{
  "About": {
    "Name": "Dapeng Wang",
    "Currently": "Computer Science Student",
    "Headshot": "student-portrait.png",
    "Thumbnail": "student-logo.webp",
    "AboutText": "Hello! I'm Dapeng Wang, a computer science student at Seattle Pacific University with a passion for programming and software development. I specialize in C++ programming and Unity game development.<br><br>I thrive on tackling difficult programming challenges and enjoy collaborative work environments where I can share my insights and learn from others.<br><br>Outside of my academic pursuits, I am actively involved in hackathons, coding contests, and open-source contributions. I believe in the importance of continuous learning and constantly seek opportunities to explore new technologies and methodologies to keep my skills sharp and up-to-date."
  },
  "Contact": {
    "EMail": "wangd3@spu.edu",
    "Phone": "(206) 823-7973",
    "Portfolio": "https://peterwamg.github.io/index.html",
    "LinkedIn": "https://www.linkedin.com/in/dapeng-wang-a0bb48220/",
    "GitHub": "https://github.com/PeterWamg"
  },
  "Experience": {
    "ExperienceText": "My journey in computer science began in high school, where I first encountered programming and was instantly fascinated by the endless possibilities it offered. This passion led me to pursue a degree in computer science at Seattle Pacific University, where I have been able to deepen my knowledge and skills in various areas such as C++ programming and Unity game development.<br><br>In addition to my academic and work commitments, I actively participate in hackathons, coding competitions, and contribute to open-source projects. These experiences have honed my problem-solving skills and have taught me the importance of collaboration and continuous learning. I am always seeking new challenges and opportunities to apply my knowledge in innovative ways",
    "School": "Seattle Pacific University",
    "Major": "Computer Science",
    "Graduation": "June 2024",
    "Employment": "No formal employment experience yet, but eager to gain experience and contribute",
    "EmploymentText": "While I may not have formal employment experience yet, I am driven and enthusiastic about gaining valuable experience and contributing effectively. I am open to opportunities and committed to learning and growing in any role I undertake. You can rest assured that I will approach any opportunity with dedication and a willingness to excel.",
    "EducationText": "I am currently pursuing my undergraduate degree in Computer Science at Seattle Pacific University. Throughout my studies, I have had the opportunity to engage with a diverse curriculum that includes courses in software development, data structures, algorithms, and computer systems.<br><br>My education has been enriched by hands-on projects and collaborative assignments that have allowed me to apply theoretical knowledge to real-world problems. One highlight of my academic journey was a project where I developed a complex C++ application, which not only solidified my understanding of the language but also enhanced my problem-solving skills.<br><br>Additionally, I have taken several courses in Unity game development, which have sparked my interest in the intersection of computer science and creative design. My time at Seattle Pacific University has been both challenging and rewarding, providing me with a strong foundation in computer science principles and the confidence to tackle complex technical challenges.",
    "Skills": ["C++", "JavaScript", "Node", "CSS", "HTML","Unity","Python","Java"],
    "SkillsText": "Throughout my academic and professional journey, I have developed a diverse set of skills that enable me to tackle a wide range of technical challenges.<br><br>My proficiency in **C++** has been honed through numerous projects and coursework, where I have built complex applications and systems. **JavaScript**, **Node**, **CSS**, and **HTML** have been central to my web development projects, allowing me to create dynamic and responsive websites.<br><br>My experience with **Unity** has opened up the world of game development, where I have designed and implemented interactive games that demonstrate both technical and creative skills. Additionally, my knowledge of **Python** and **Java** has been applied in various contexts, from scripting and automation to developing robust software solutions.<br><br>These skills are not just theoretical but are backed by practical experience gained through hackathons, coding competitions, and open-source contributions. I am continuously seeking to expand my skill set and stay updated with the latest advancements in technology.",
    "Resume": "DapengResume.pdf"
  },
  "Project1": {
    "Title": "SPU-GradPro",
    "Desc": "This is a game for SPU student created by our team.",
    "GitHubRepo": "https://github.com/kimanjea/SPU-GradPro",
    "MainImage": "SPUGrad.png",
    "DetailImages": ["SPU1.png", "SPU2.png", "SPU3.png"]
  },
  "Project2": {
    "Title": "Blackjack card game",
    "Desc": "This is a game I wrote by Rust",
    "GitHubRepo": "https://github.com/PeterWamg/A-Game",
    "MainImage": "blackjack.png",
    "DetailImages": ["b1.png"]
  },
  "Project3": {
    "Title": "Algorithms",
    "Desc": "Personal Analysis of Algorithms",
    "GitHubRepo": "https://github.com/PeterWamg/Algorithms",
    "MainImage": "AL1.png",
    "DetailImages": ["D.png", "DC.png", "I.png"]
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
